SadButTrueUK/OKPS-E-K/Firmware/src/drv/dsPIC33_rs422.c
/**
* \file    dsPIC33_rs422.c
* \brief   \copybrief dsPIC33_rs422.h
* 
* \version 1.0.1
* \date    14-05-2018
* \author  Агулов М.А.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "dsPIC33_rs422.h"
#include "MainRegisters.h"

//*****************************************************************************
// Локальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
#define BAUDRATE 263314                                 ///< Скорость обмена по интерфейсу RS-422.
#define BRGVAL   ( ( Fcy / BAUDRATE ) / 16 ) - 1        ///< Значение делителя для тактирования обмена.

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
// Инициализация регистров UART1 и пина DE1
void init_L1( void )
{
    // *** Конфигурация пина DE1 ***
    _TRISE0 = 1;
    _LATE0 = 1;
    ANSELEbits.ANSE0 = 0;

    // *** Конфигурация пинов для UART1 ***
    ANSELCbits.ANSC3 = 0;   // Пин используется как цифровой
    ODCEbits.ODCE1 = 1;     // Пин типа "открытый коллектор"
    RPINR18bits.U1RXR = 51; // С какого пина брать данные для UART1
    RPOR9bits.RP81R = 1;    // Источник данных для пина

    // *** Конфигурация регистров управления UART1 ***
    U1BRG = BRGVAL;        // Baud Rate setting
    U1MODEbits.LPBACK = 0; // TEST
    U1MODEbits.STSEL = 0;  // 1-Stop bit
    U1MODEbits.PDSEL = 0;  // No Parity, 8-Data bits
    U1MODEbits.URXINV = 0; // UxRx Idle state is '1'
    U1MODEbits.BRGH = 0;   // Low-Speed mode
    U1MODEbits.ABAUD = 0;  // Auto-Baud disabled
    U1MODEbits.UARTEN = 1; // Enable UART
    U1STAbits.UTXEN = 1;   // Enable UART TX
}

//*****************************************************************************
// Инициализация регистров UART2 и DE2
void init_L2( void )
{
    // *** Конфигурация пина DE2 ***    
    _TRISA4 = 1;
    _LATA4 = 1;
    ANSELAbits.ANSA4 = 0;

    // *** Конфигурация пинов для UART2 ***
    ANSELAbits.ANSA9 = 0;   // Пин используется как цифровой
    ODCBbits.ODCB4 = 1;     // Пин типа "открытый коллектор"
    RPINR19bits.U2RXR = 25; // С какого пина брать данные для UART2
    RPOR1bits.RP36R = 3;    // Источник данных для пина

    // *** Конфигурация регистров управления UART2 ***
    U2BRG = BRGVAL;        // Baud Rate setting
    U2MODEbits.LPBACK = 0; // TEST
    U2MODEbits.STSEL = 0;  // 1-Stop bit
    U2MODEbits.PDSEL = 0;  // No Parity, 8-Data bits
    U2MODEbits.URXINV = 0; // UxRx Idle state is '1'
    U2MODEbits.BRGH = 0;   // Low-Speed mode
    U2MODEbits.ABAUD = 0;  // Auto-Baud disabled
    U2MODEbits.UARTEN = 1; // Enable UART
    U2STAbits.UTXEN = 1;   // Enable UART TX
}

//*****************************************************************************
// Управление приемом/передачей данных по RS-422 UART1
void dirL1( bool dir )
{
    dir ? ( _TRISE0 = 0 ) : ( _TRISE0 = 1 );
}

//*****************************************************************************
// Прием данных по RS-422 UART1
bool RxByte_L1( uint8_t *data )
{
    if( U1STAbits.URXDA )
    {
        *data = U1RXREG;
        return true;
    }
    else
        return false;
}

//*****************************************************************************
// Передача байта данных по линии RS-422 UART1
bool TxByte_L1( uint8_t data )
{
    if( U1STAbits.UTXBF )
        return false;   // Буфер передатчика занят
    else
    {
        U1TXREG = data; // Буфер передатчика свободен, записываем в него данные
        return true;
    }
}

//*****************************************************************************
// Определение окончания передачи по RS-422 UART1
bool isTxCompl_L1( void )
{
    return U1STAbits.TRMT;
}

//*****************************************************************************
// Управление приемом/передачей данных по RS-422 UART2
void dirL2( bool dir )
{
    dir ? ( _TRISA4 = 0 ) : ( _TRISA4 = 1 );
}

//*****************************************************************************
// Прием байта данных по RS-422 UART2
bool RxByte_L2( uint8_t *data )
{
    if( U2STAbits.URXDA )
    {
        *data = U2RXREG;
        return true;
    }
    else
        return false;
}

//*****************************************************************************
// Передача байта данных по RS-422 UART2
bool TxByte_L2( uint8_t data )
{
    if( U2STAbits.UTXBF )
        return false;
    else
    {
        U2TXREG = data;
        return true;
    }
}

//*****************************************************************************
// Определение окончания передачи по RS-422 UART2
bool isTxCompl_L2( void )
{
    return U2STAbits.TRMT;
}

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   14-05-2018
* Автор  Агулов М.А.
*
* Изменения:
*    Базовая версия.
*/
